Repository: flammie/purplemonkeydishwasher
Catalog: 2016-iwclul/et-fi (1).tmx
Source language: et
Languages: fi

source: eksponent on väiksem kui 0
fi: eksponentti on pienempi kuin 0

source: puudub `)'
fi: puuttuva ”)”

source: süntaksi viga: oodati operandi
fi: lauseoppivirhe: odotettiin operandia

source: süntaksi viga: vigane aritmeetiline operaator
fi: lauseoppivirhe: virheellinen aritmetiikkaoperaattori

source: vigane aritmeetiline baas
fi: virheellinen lukujärjestelmä

source: väärtus on baasiks liiga suur
fi: liian iso luku lukujärjestelmälle

source: getcwd: vanemkataloogidele ei ole juurdepääsu
fi: getcwd: ylempiin hakemistoihin ei päästä

source: describe_pid: %ld: pid puudub
fi: describe_pid: %ld: prosessitunnusta ei löydy.

source: Tehtud
fi: Valmis

source: Peatatud
fi: Pysäytetty

source: Töös
fi: Ajossa

source: Tundmatu olek
fi: Tuntematon tila

source: wait_for_job: töö %d on peatatud
fi: wait_for_job: työ %d on pysäytetty

source: %s: töö on lõpetatud
fi: %s: työ on lopetettu

source: %s: töö %d on juba taustal
fi: %s: työ %d on jo taustalla

source: vigane baas
fi: virheellinen lukujärjestelmä

source: %s: tundmatu masin
fi: %s: tuntematon palvelin

source: %s: vigane teenus
fi: %s: virheellinen palvelu

source: Teil on kiri kaustas $_
fi: Sinulle on postia laatikossa $_

source: Teil on uus kiri kaustas $_
fi: Sinulla on uutta postia laatikossa $_

source: Kiri kaustas %s on loetud
fi: Posti laatikossa %s on luettu

source: süntaksi viga: nõutakse aritmeetilist avaldist
fi: lauseoppivirhe: vaaditaan aritmeettinen lauseke

source: süntaksi viga: ootamatu `;'
fi: lauseoppivirhe: odottamaton ”;”

source: süntaksi viga: `((%s))'
fi: lauseoppivirhe: ”((%s))”

source: süntaksi viga tingimuslikus avaldises
fi: lauseoppivirhe ehdollisessa lausekkeessa

source: ootamatu märk `%s', oodati `)'
fi: odottamaton avainsana ”%s”, odotettiin ”)”

source: oodati `)'
fi: odotettiin ”)”

source: süntaksi viga kohal `%s'
fi: lauseoppivirhe lähellä ”%s”

source: süntaksi viga: ootamatu faililõpp
fi: lauseoppivirhe: odottamaton tiedostonloppu

source: süntaksi viga
fi: lauseoppivirhe

source: Käsuinterpretaatorist väljumiseks kasutage "%s".
fi: Kirjoita ”%s” poistuaksesi komentotulkista.

source: faili deskriptor on piiridest väljas
fi: tiedostokahva rajojen ulkopuolella

source: %s: segane ümbersuunamine
fi: %s: epämääräinen uudelleenohjaus

source: %s: fail on olemas, ei kirjuta üle
fi: %s: olemassa olevan tiedoston päälle ei voida kirjoittaa

source: %s: piiratud: väljundit ei saa ümber suunata
fi: %s: rajoitettu: tulostusta ei voida uudelleenohjata

source: viga ümbersuunamisel: fd duplikaadi loomine ei õnnestu
fi: virhe uudelleenohjauksessa: tiedostokahvaa ei voida kopioida

source: /tmp puudub, palun looge see!
fi: /tmp-hakemistoa ei löytynyt, luo se!

source: /tmp peab olema kataloogi nimi
fi: /tmp:n pitää olla kelvollinen hakemiston nimi

source: %c%c: vigane võti
fi: %c%c: virheellinen valitsin

source: Mul ei ole nime!
fi: Minulla ei ole nimeä!

# Kasuta: %s [GNU pikk võti] [võti] ... %s [GNU pikk võti] [võti] skript-fail ...
source: Kasuta:\t%s [GNU pikk võti] [võti] ... \t%s [GNU pikk võti] [võti] skript-fail ...
fi: Käyttö:\t%s[GNU:n pitkä valitsin] [valitsin] ... \t%s [GNU:n pitkä valitsin] [valitsin] komentotiedosto ...

source: GNU pikad võtmed:
fi: GNU:n pitkät valitsimet:

source: Käsuinterpretaatori võtmed:
fi: Komentotulkin valitsimet:

# -irsD või -c käsklus või -O lühivõti (ainult käivitamine)
source: \t-irsD või -c käsklus või -O lühivõti\t\t(ainult käivitamine)
fi: \t-irsD tai -c komento tai -O shopt_option (ainoastaan käynnistettäessä)

# -%s või -o võti
source: \t-%s või -o võti
fi: \t-%s tai -o -valitsin

source: Vigadest teatamiseks kasutage käsku `bashbug'.
fi: Raportoi virheet komennolla ”bashbug”.

source: sigprocmask: %d: vigane operatsioon
fi: sigprocmask: %d: virheellinen operaatio

source: %s: parameeter on null või pole seatud
fi: %s: parametria ei ole tai sitä ei ole asetettu

source: %s: halb asendus
fi: %s: virheellinen korvaus

source: $%s: sedasi ei saa omistada
fi: $%s: ei voida asettaa näin

source: ei leitud: %s
fi: ei osumia: %s

source: oodati argumenti
fi: odotettiin argumenttia

source: %s: oodati täisarvude avaldist
fi: %s: odotettiin kokonaislukuilmaisua

source: oodati `)', saadi %s
fi: odotettiin ”)”, löydettiin %s

source: %s: eeldati unaarset operaatorit
fi: %s: odotettiin unaarista operaattoria

source: %s: eeldati binaarset operaatorit
fi: %s: odotettiin binääristä operaattoria

source: puudub `]'
fi: puuttuva ”]”

source: vigane signaali number
fi: virheellinen signaalinumero

source: run_pending_traps: halb väärtus muutujas trap_list[%d]: %p
fi: run_pending_traps: virheellinen arvo trap_list[%d]: %p

source: run_pending_traps: signaali käsitleja on SIG_DFL, saadan %d (%s) iseendale
fi: run_pending_traps: signaalikäsittelijä on SIG_DFL, lähetän %d (%s) uudelleen itselleni

source: trap_handler: vigane signaal %d
fi: trap_handler: virheellinen signaali %d

source: shelli tase (%d) on liiga kõrge, kasutan väärtust 1
fi: komentotulkkitaso (%d) liian korkea, palautetaan 1:ksi

source: make_local_variable: praegune skoop pole funktsiooni kontekst
fi: make_local_variable: ei funktiokontekstia nykytilassa

source: all_local_variables: praegune skoop pole funktsiooni kontekst
fi: all_local_variables: ei funktiokontekstia nykytilassa

source: pop_var_context: pole global_variables kontekst
fi: pop_var_context: ei global_variables-kontekstia

source: süntaksi viga: ei saa toetada
fi: syntaksivirhe: ei voida tehdä varmuuskopiota

source: süntaks on segane
fi: syntaksi on moniselitteinen

source: süntaksi viga, ootamatu %s
fi: syntaksivirhe, odottamaton %s

source: süntaksi viga, ootamatu %s, ootasin %s
fi: syntaksivirhe, odottamaton %s, odotetaan %s

source: süntaksi viga, ootamatu %s, ootasin %s või %s
fi: syntaksivirhe, odottamaton %s, odotetaan %s tai %s

source: süntaksi viga, ootamatu %s, ootasin %s või %s või %s
fi: syntaksivirhe, odottamaton %s, odotetaan %s tai %s tai %s

source: süntaksi viga, ootamatu %s, ootasin %s või %s või %s või %s
fi: syntaksivirhe, odottamaton %s, odotetaan %s tai %s tai %s tai %s

source: mälu on otsas
fi: muisti loppui

source: fataalne viga
fi: vakava virhe

source: viga
fi: virhe

source: hoiatus
fi: varoitus

source: mittesoovitatav direktiiv, kasutage %s
fi: vanhentunut direktiivi, käytä %s

source: mittesoovitatav direktiiv: %s, kasutage %s
fi: vanhentunut direktiivi: %s, käytä %s

source: reeglis on lubatud ainult üks %s
fi: vain yksi %s on sallittu sääntöä kohden

source: eelmine deklaratsioon
fi: edellinen esittely

source: Konflikt reegli %d ja märgi %s vahel lahendatud nihkega
fi: Säännön %d ja merkkisymbolin %s välinen ristiriita on ratkaistu siirtona

source: Konflikt reegli %d ja märgi %s vahel lahendatud redutseerimisega
fi: Säännön %d ja merkkisymbolin %s välinen ristiriita on ratkaistu supistamisena

source: Konflikt reegli %d ja märgi %s vahel lahendatud veana
fi: Säännön %d ja merkkisymbolin %s välinen ristiriita on ratkaistu virheenä

source: Olek %d
fi: Tila %d

source: konfliktid: %d nihutamine/redutseerimine, %d redutseerimine/redutseerimine
fi: ristiriidat: %d siirto/supistaminen, %d supistaminen/supistaminen

source: konfliktid: %d nihutamine/redutseerimine
fi: ristiriidat: %d siirto/supistaminen

source: konfliktid: %d redutseerimine/redutseerimine
fi: ristiriidat: %d supistaminen/supistaminen

source: %%expect-rr puudutab ainult GLR parsereid
fi: %%expect-rr soveltuu vain GLR-jäsentimiin

source: nihutamine/redutseerimine konfliktid: %d leitud, %d eeldati
fi: siirto/supistaminen -ristiriitoja: %d löytyi, %d odotettiin

source: redutseerimine/redutseerimine konflikti: %d leitud, %d eeldati
fi: supistaminen/supistaminen -ristiriitoja: %d löytyi, %d odotettiin

source: %s: ei saa avada
fi: %s: tiedoston avaus epäonnistui

source: sisend/väljund viga
fi: syöttö/tulostevirhe

source: faili ei õnnestu sulgeda
fi: tiedoston sulkeminen epäonnistui

source: keeldun sisendfaili %s üle kirjutamast
fi: kieltäydytään korvaamasta syötetiedostoa %s

source: konfliktsed väljundid faili %s
fi: keskenään ristiriitaisia tulosteita tiedostoon %s

source: Lisainfo saamiseks proovige '%s --help'.
fi: Pyydä lisätietoja komennolla ’%s --help’.

source: Kasuta: %s [VÕTI]...FAIL
fi: Käyttö: %s [VALITSIN]... TIEDOSTO

source: Genereeri determineeritud LR või üldistatud LR (GLR) parser kasutades LALR(1), IELR(1) või kanoonilisi LR(1) parseri tabeleid. IELR(1) ja kanoonilise LR(1) tugi on eksperimentaalne.
fi: Tuota deterministinen LR- tai yleistetty LR (GLR) -jäsennin, joka käyttää LALR(1)-, IELR(1)-, tai kanonisia LR(1)-jäsennintauluja. IELR(1)- ja kanoninen LR(1) -tuki on kokeellinen.

source: Kohustuslikud argumendid pikkadele võtmetele on kohustuslikus ka lühikestele.
fi: Pakolliset argumentit pitkille valitsimille ovat pakollisia myös lyhyille valitsimille.

source: Sama ka mittekohustuslike argumentide korral.
fi: Sama pätee valinnaisille argumenteille.

source: Töömoodid: -h, --help esita see abiinfo ja lõpeta töö -V, --version esita versiooniinfo ja lõpeta töö --print-localedir esita lokaadi infot sisaldava kataloogi nimi --print-datadir esita skelettide ja XSLT kataloogi nimi -y, --yacc emuleeri POSIX yacc -W, --warnings[=KATEGOORIA] raporteeri antud kategooria hoiatusi -f, --feature[=OMADUS] aktiveeri muid omadusi
fi: Toimintotilat: -h, --help näytä tämä opaste ja poistu -V, --version tulosta versiotiedot ja poistu --print-localedir tulostehakemisto, joka sisältää maa-asetuksesta riippuvaa dataa --print-datadir tulostehakemisto, joka sisältää rungot ja XSLT-koodin -y, --yacc matki POSIX Yacc -ohjelmaa -W, --warnings=[KATEGORIA] raportoi tähän KATEGORIAan kuuluvat varoitukset -f, --feature[=OMINAISUUS] aktivoi sekalaiset ominaisuudet

source: Parser: -L, --language=KEEL määra väljudi programmeerimise keel -S, --skeleton=FAIL kasutatava skeleti kirjeldus -t, --debug varusta parser silumisinfoga sama, kui '-Dparse.trace' --locations luba asukohtade arvestamine -D, --define=NIMI[=VÄÄRTUS] sama kui '%define NIMI \\"VÄÄRTUS\\"' -F, --force-define=NIMI[=VÄÄRTUS] kirjuta '%define NIMI \\"VÄÄRTUS\\"' üle -p, --name-prefix=PREFIKS lisa välissümbolite nimedele PREFIKS kasutage selle asemel '-Dapi.prefix=PREFIKS' -l, --no-lines ära genereeri '#line' direktiive -n, --no-parser genereeri ainult tabelid -k, --token-table lisa ka sümbolite nimede tabel
fi: Jäsennin: -L, --language=KIELI määrittele tulosteohjelmointikieli -S, --skeleton=TIEDOSTO määrittele käytettävä runko -t, --debug lisää jäsennin vianjäljitykseen sama kuin ’-Dparse.trace’ --locations ota käyttöön paikkojen laskenta -D, --define=NIMI[=ARVO] samanlainen kuin ’%define NIMI "ARVO"’ -F, --force-define=NIMI[=ARVO] korvaa määrittelyn ’%define NIMI "ARVO"’ -p, --name-prefix=ETULIITE lisää ETULIITE ulkoisiin symboleihin valitsimen ’-Dapi.prefix=ETULIITE’ vanhentama -l, --no-lines älä tuota ’#line’-direktiivejä -k, --token-table sisällytä merkkisymbolinimien taulu

source: Väljund: --defines[=FAIL] loo ka päisfail -d sama, aga faili nime ei saa määrata (POSIX Yacc) -r, --report=ASJAD väljasta automaadi kohta selgitusi --report-file=FAIL kirjuta raport faili -v, --verbose sama, kui '--report=state' -b, --file-prefix=PREFIKS kasuta väljundfailide nimedes PREFIKSit -o, --output=FAIL jäta väljund FAILi -g, --graph loo automaadi kirjeldus graafina -x, --xml[=FAIL] loo automaadi XML raport (XML skeem on eksperimentaalne)
fi: Tuloste: --defines[=TIEDOSTO] tuota myös otsaketiedosto -d samoin, mutta TIEDOSTOn (POSIX Yacc-yhteensopivuus)määrittely epäonnistui -r, --report=THINGS tuota myös yksityiskohdat automaatissa --report-file=TIEDOSTO kirjoita raportti TIEDOSTOon -v, --verbose sama kuin ’--report=state’ -b, --file-prefix=ETULIITE määrittele ETULIITE tulostetiedostoille -o, --output=TIEDOSTO jätä tuloste TIEDOSTOon -g, --graph[=TIEDOSTO] tulosta myös automaatin kaavio -x, --xml[=TIEDOSTO] tulosta myös automaatin XML-raportti (XML-skeema on kokeellinen)

source: Hoiatuste kategooriad on järgnevad: 'midrule-values' seadmata või kasutamata vahereeglite väärtused 'yacc' mitteühilduvused POSIX Yacc suhtes 'conflicts-sr' S/R konfliktid (vaikimisi) 'conflicts-rr' R/R konfliktid (vaikimisi) 'deprecated' aegunud konstruktsioonid 'empty-rule' %empty võtmesõnaga märkimata tühjad reeglid 'precedence' kasutu järjelprd ja assotsiatiivsus 'other' kõik muud hoiatused (vaikimisi) 'all' kõik hoiatused 'no-CATEGORY' keela antud kategooria hoiatused 'none' keela kõik hoiatused 'error[=CATEGORY]' käsitle hoiatusi vigadena
fi: Varoituskategoriat sisältävät: 'midrule-values' asettaa ja poistaa midrule-arvoja 'yacc' yhteensopimattomuudet POSIX YACC -ohjelman kanssa 'conflicts-sr' S/R-ristiriidat (oletuksena otettu käyttöön) 'conflicts-rr' R/R-ristiriidat (oletuksena otettu käyttöön) 'deprecated' vanhentuneet rakenteet 'empty-rule' tyhjät säännöt ilman %empty 'precedence' kelpaamaton etuoikeus ja liitännäisyys 'other' kaikki muut varoitukset (oletuksena otettu käyttöön) 'all' kaikki varoitukset 'no-CATEGORY' käännä pois päältä kaikki varoitukset kategoriassa KATEGORIA 'none' käännä pois kaikki varoitukset 'error[=KATEGORIA]' käsittele varoituksia virheinä

source: ASJAD on loend komadega eraldatud järgnevaid sõnu: 'state' olekute kirjeldus 'itemset' täienda põhilisi elemente nende sulunditega 'lookahead' seo ettevaatamised elementidega 'solved' kirjelda nihuta/redutseeri konfliktide lahendamisi 'all' kogu ülaltoodud info 'none' blokeeri raport
fi: THINGS on pilkuilla eroteltu luettelo, joka voi sisältää: 'state' kuvaa tilat 'itemset' täydentää ydinalkiojoukot niiden sulkeumalla 'lookahead' eksplisiittisesti liittää ennakointimerkkisymbolit alkioihin 'solved' kuvailee siirto/supistaminen -ristiriitojen ratkaisemisen 'all' sisältää kaikki yllä mainitut tiedot 'none' poistaa raportoinnin

source: OMADUS on komadega eraldatud järgnevate sõnade loend: 'caret' märgi vead sümboliga ^ 'all' kõik ülaltoodud 'none' blokeeri kõik ülaltoodud
fi: OMINAISUUS on pilkulla eroteltu sanojen luettelo, joka voi sisältää: 'caret' näytä kaikki virheet sirkumfleksillä 'all' kaikki yllä olevat 'none' ota pois käytöstä kaikki yllä olevat

source: Teatage palun vigadest aadressil .
fi: Ilmoita virheistä (englanniksi) osoitteeseen .

source: %s koduleht: .
fi: %s kotisivu: .

source: Üldine abiinfo GNU tarkvara kohta: .
fi: Yleinen opaste GNU-ohjelmistojen käyttämisestä: .

source: Tõlkevigadest teatage palun aadressil .
fi: Ilmoita käännösvirheistä osoitteeseen <translation\-team\-fi\@lists\.sourceforge\.net>.

source: Täieliku dokumentatsiooni lugemiseks käivitage: info bison.
fi: Täydellisen dokumentaation saat suorittamalla komennon: info bison.

source: Kirjutanud Robert Corbett ja Richard Stallman.
fi: Kirjoittajat: Robert Corbett ja Richard Stallman.

source: Autoriõigus © %d Free Software Foundation, Inc.
fi: Copyright © %d Free Software Foundation, Inc.

source: See on vaba tarkvara; kopeerimistingimused leiate lähtetekstidest. Garantii PUUDUB; ka müügiks või mingil eesmärgil kasutamiseks.
fi: Tämä on vapaa ohjelmisto: katso lähdekoodista kopiointiehdot. Ohjelmalle EI OLE MITÄÄN TAKUUTA; ei edes KAUPPAKELPOISUUDELLE tai SOPIVUUDELLE TIETTYYN TARKOITUKSEEN.

source: korduvad skeleti deklaratsioonid ei ole lubatud
fi: monirunkoesittelyt ovat virheellisiä

source: %s: vigane keel
fi: %s: virheellinen kieli

source: korduvad keele deklaratsioonid ei ole lubatud
fi: monikieliesittelyt ovat virheellisiä

source: %s: puudub operand
fi: %s: puuttuva operandi

source: liigne operand %s
fi: ylimääräinen operandi %s

source: Grammatika
fi: Kielioppi

source: // Genereeris %s. // Vigadest teatage . // Koduleht: .
fi: // Tuottaja: %s. // Ilmoita vioista osoitteeseen . // Ilmoita käännösvirheistä osoitteeseen <translation\-team\-fi\@lists\.sourceforge\.net>. // Kotisivu: .

source: rea numbri ületäitumine
fi: rivinumeron ylivuoto

source: veeru numbri ületäitumine
fi: sarakenumeron ylivuoto

source: reegel on konfliktide tõttu kasutu
fi: sääntö ei kelpaa jäsentimessä ristiriitojen vuoksi

source: %%define muutuja %s deklareeriti uuesti
fi: %%define-muuttuja %s on määritelty uudelleen

source: %s: defineerimata %%define muutuja %s
fi: %s: määrittelemätön %%define-muuttuja %s

source: vigane %%define tõeväärtus muutuja %s väärtus
fi: virheellinen arvo kohteelle %%define-booleanmuuttuja %s

source: vigane väärtus %%define muutujale %s: %s
fi: virheellinen arvo kohteelle %%define-muuttuja %s: %s

source: lubatud väärtus: %s
fi: hyväksytty arvo: %s

source: parameetri deklaratsioonis puudub identifikaator
fi: puuttuva tunniste parametriesittelyssä

source: tüüp %d on %s
fi: tyyppi %d on %s

source: nihuta ja liigu olekule %d
fi: siirto, ja siirry tilaan %d

source: liigu olekule %d
fi: siirry tilaan %d

source: viga (mitteassotsiatiivne)
fi: virhe (ei-assosiatiivinen)

source: redutseerin kasutades reeglit %d (%s)
fi: supistaminen käyttäen sääntöä %d (%s)

source: nõustun
fi: accept

source: Terminalid, koos reeglitega kus nad ilmuvad
fi: Päätteet, säännöillä missä niin tarvitaan

source: Mitteterminalid, koos reeglitega kus nad ilmuvad
fi: Ei-päätteet, säännöillä missä niitä tarvitaan

source: vasakul:
fi: vasemmalla:

source: paremal:
fi: oikealla:

source: Reeglid on parseris konfliktide tõttu kasutud
fi: Säännöt eivät kelpaa jäsentimessä ristiriitojen vuoksi

source: korduvad %s deklaratsioonid
fi: useita %s esittelyjä

source: tulemuse tüübikonflikt mestimise funktsioonis %s: !=
fi: tulostyyppien yhteentörmäys merge-funktiossa %s: !=

source: ignoreerin dubleeritud sümboli nime %s
fi: kaksoiskappalesymbolinimi kohteelle %s ohitettiin

source: %s jaoks on antud reegel, aga see on märk
fi: sääntö annettu kohteelle %s, joka on merkkisymboli

source: vaikimisi tegevuse tüübikonflikt: !=
fi: tyyppien törmäys vastakkain oletustoiminassa: !=

source: tüübiga mitteterminalil on tühi reegel ja puudub tegevus
fi: tyhjä sääntö tyypitetylle ei-päätteelle, ja ei toimintoa

source: kasutamata väärtus: $%d
fi: käyttämätön arvo: $%d

source: seadmata väärtus: $$
fi: asettamaton arvo: $$

source: %%empty mitte-tühjal reeglil
fi: %%empty ei-tyhjässä säännössä

source: tühjal reeglil puudub %%empty
fi: tyhjä sääntö ilman %%empty

source: %%prec märgend ei ole defineeritud: %s
fi: merkkisymbolia kohteelle %%prec ei ole määritelty: %s

source: %s puudutab ainult GLR parsereid
fi: %s vaikuttaa vain GLR-jäsentimiin

source: %s järel peab olema positiivne number
fi: kohdetta %s on seurattava postiivinen numero

source: reegel on liiga pikk
fi: sääntö on liian pitkä

source: sisendgrammatikas pole reegleid
fi: ei sääntöjä syötekieliopissa

source: reegel ei ole grammatikas kasutatav
fi: sääntö ei kelpaa kieliopissa

source: mitteterminal on grammatikas kasutu: %s
fi: ei-pääte ei kelpaa kieliopissa: %s

source: Mitteterminalid ei ole grammatikas kasutatavad
fi: Ei-päätteet eivät kelpaa kieliopissa

source: Grammatikas mitte kasutatud terminalid
fi: Päätteet ovat käyttämättömiä kieliopissa

source: Grammatikas kasutud reeglid
fi: Säännöt eivät kelpaa kieliopissa

source: stardisümbolist %s ei tuletata ühtegi lauset
fi: aloitussymboli %s ei johda lauseeseen

source: liigne '%s'
fi: yksinäinen ’%s’

source: viitab: %c%s kohal %s
fi: viittaa kohteeseen: %c%s osoitteessa %s

source: arvatavasti mõeldi: %c
fi: mahdollisesti tarkoitti: %c

source: , peidab %c
fi: , piilotetaan %c

source: kohal %s
fi: osoitteessa %s

source: , ei saa vahe reegli tegevusel kasutada kohal $%d
fi: , ei kyetä käyttämään mid-rule -toimintoa osoitteessa $%d

source: number piiridest väljas: %s
fi: kokonaisluku on lukualueen ulkopuolella: %s

source: vigane viide: %s
fi: virheellinen viite: %s

source: süntaksi viga peale '%c', ootan numbrit, tähte, '_', '[' või '$'
fi: syntaksivirhe merkin ’%c’ jälkeen, odotettiin kokonaislukua, kirjainta, tai merkkejä ’_’, ’[’, ’$’

source: sümbol puudub produktsioonis $%d ees: %.*s
fi: symbolia ei löytynyt tuotannosta ennen $%d: %.*s

source: sümbol puudub produktsioonis: %.*s
fi: symbolia ei löytynyt tuotannosta: %.*s

source: segadust tekitav viide: %s
fi: harhaanjohtava viite: %s

source: segane viide: %s
fi: ei-yksiselitteinen viite: %s

source: tüüpimata grammatikas kasutati konkreetset tüüpi
fi: eksplisiittinen tyyppi annettu tyypittömässä kieliopissa

source: $$ vahereeglis kohal $%d '%s' ei oma deklareeritud tüüpi
fi: $$ midrule-lohkolle osoitteessa $%d/%s ei ole esiteltyä tyyppiä

source: $$ märgil '%s' ei oma deklareeritud tüüpi
fi: $$/%s ei ole esitelty tyyppi

source: $%s märgil '%s' ei oma deklareeritud tüüpi
fi: $%s/%s ei ole esitelty tyyppi

source: käsitlen juhuslikku ',' kui tühikut
fi: yksinäinen ’,’ käsitellään tyhjemerkkinä

source: vigane juhus: %s
fi: virheellinen direktiivi: %s

source: vigane identifikaator: %s
fi: virheellinen tunniste: %s

source: vigane null sümbol
fi: virheellinen null-merkki

source: nurksulgudes nimes on eeotamatu identifikaator: %s
fi: odottamaton tunniste sulkumerkillisessä nimessä: %s

source: oodati identifikaatorit
fi: odotettiin tunnistetta

source: tühi sümbol literaal
fi: tyhjä merkkiliteraali

source: liigsed sümbolid sümbol literaalis
fi: ylimääräisiä merkkejä merkkiliteraalissa

source: vigane number peale \\-jada: %s
fi: virheellinen numero \\-koodinvaihtomerkin jälkeen: %s

source: vigane sümbol peale \\-jada: %s
fi: virheellinen merkki \\-koodinvaihtomerkin jälkeen: %s

source: faili lõpus puudub %s
fi: puuttuva %s tiedoston lopussa

source: rea lõpus puudub %s
fi: puuttuva %s rivin lopussa

source: skeletis on sulgemata %s direktiiv
fi: sulkematon %s-direktiivi rungossa

source: skeletis on %s direktiivile liiga vähe argumente
fi: liian vähän argumentteja %s-direktiiville rungossa

source: skeletis on %s direktiivile liiga palju argumente
fi: liian monta argumenttia %s-direktiiville rungossa

source: vigane $ väärtus: $%d
fi: virheellinen $-arvo: $%d

source: POSIX Yacc keelab kriipsud sümbolite nimedes: %s
fi: POSIX Yacc kieltää ajatusviivat symbolinimissä: %s

source: sisendgrammatikas on liiga palju sümboleid (piirang on %d)
fi: liian monta symbolia syötekieliopissa (raja on %d)

source: %s uuesti deklareerimine %s jaoks
fi: %s uudelleenesittely kohteelle %s

source: %s deklareeriti jaoks uuesti
fi: %s uudelleenesittely kohteelle

source: sümbol %s on uuesti defineeritud
fi: symboli %s on määritelty uudelleen

source: sümbol %s on uuesti deklareeritud
fi: symboli %s on esitelty uudelleen

source: %s kasutaja märgi numbri uuesti defineerimine
fi: määritellään uudelleen kohteen %s käyttäjämerkkisymbolinumero

source: kasutatakse sümbolit %s, mis ei ole defineeritud märgina ja millel puuduvad reeglid
fi: symbolia %s käytetään, mutta sitä ei ole määritelty merkkisymbolina eikä sillä ole sääntöjä

source: kasutu %s tüübil
fi: kelpaamaton %s tyypille

source: kasutatakse tüüpi , mis ei ole seostatud ühegi sümboliga
fi: tyyppiä käytetään, mutta sitä ei ole liitetty mihinkään symboliin

source: sümbolit %s on kasutatud enam kui kord literaal sõnena
fi: symbolia %s on käytetty useammin kuin kerran literaalimerkkijonona

source: sümbolile %s on antud enam kui üks literaal sõne
fi: symboli %s on annettu useammassa kuin yhdessä literaalimerkkijonossa

source: kasutaja märgi number %d uuesti deklareerimine %s jaoks
fi: käyttäjämerkkijononumeron %d uudelleenesittely kohteelle %s

source: %s eelmine deklaratsioon
fi: edellinen esittely kohteelle %s

source: stardisümbol %s ei ole defineeritud
fi: aloitussymboli %s on määrittelemätön

source: stardisümbol %s on märk
fi: aloitussymboli %s on merkkisymboli

source: %s jaoks kasutu järjekord ja assotsiatiivsus
fi: kelpaamaton ensisijaisuus ja liitettävyys kohteelle %s

source: %s jaoks kasutu järjekord
fi: kelpaamaton ensisijaisuus kohteelle %s

source: %s jaoks kasutu assotsiatiivsus, kasutage %%precedence
fi: kelpaamaton liitettävyys kohteelle %s, käytä %%precedence

source: '%s' eemaldamine ebaõnnestus
fi: kohteen ’%s’ poistaminen epäonnistui
